dafoam-tutorials-main/JBC_Hull/0.orig/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [ 0 2 -1 0 0 0 0 ];

internalField uniform 1.0e-5;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    back
    {
        type            zeroGradient;
    }
    front
    {
        type            zeroGradient;
    }
    top
    {
        type            symmetry;
    }
    bot
    {
        type            zeroGradient;
    }
    hull
    {
        type            fixedValue;
        value           uniform 1e-16;
    }

}
