dafoam-tutorials-main/JBC_Hull/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions     [ 0 2 -2 0 0 0 0 ];
internalField   uniform 0.0;

boundaryField
{

    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    back
    {
        type            zeroGradient;
    }
    front
    {
        type            zeroGradient;
    }
    top
    {
        type            symmetry;
    }
    bot
    {
        type            zeroGradient;
    }
    hull
    {
        type            zeroGradient;
    }

}
